Tekla.Structures.Model.RebarGeometry
The RebarGeometry class represents a single physical reinforcing bar - the building block of
a mesh, a rebar group and even a single rebar.
It contains the physical reinforcing bar points in 3D space.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
public class Example
{
public void Example1()
{
RebarGroup Group = new RebarGroup();
ArrayList RebarGeoms = Group.GetRebarGeometries(true);
foreach (RebarGeometry Rebar in RebarGeoms)
{
if (Rebar != null)
{
Console.WriteLine("Wire {0} has the following points:");
foreach (Point p in Rebar.Shape.Points)
{
Console.WriteLine("[{0},{1},{2}]", p.X, p.Y, p.Z);
}
}
}
}
}

Tekla.Structures.Model.RebarGeometry.WIRE_TRANSFER_STACK_SIZE
Constant indicating the number of rebar geometries transferred at once from Tekla Structures.

Tekla.Structures.Model.RebarGeometry.MAX_REBAR_POSITION_POINTS
Constant indicating the maximum number of position points for a wire.

Tekla.Structures.Model.RebarGeometry.Shape
The physical points of the reinforcing bar.

Tekla.Structures.Model.RebarGeometry.Diameter
The diameter of the wire.

Tekla.Structures.Model.RebarGeometry.BendingRadiuses
The bending radiuses of the wire.

Tekla.Structures.Model.RebarGeometry.#ctor
The constructor for RebarGeometry. The class requires index which
indicates the position in the rebar group. Index starts with 1.

Tekla.Structures.Model.RebarGeometry.FromLists(Tekla.Structures.ModelInternal.PointList,Tekla.Structures.ModelInternal.DoubleList,System.Int32,System.Int32,System.Int32)
Internal method for transforming struct received over .NET interface into RebarGeometry class.
pointList: All the points in for all polygons in the object.
diameterAndRadiiList: An array containing all the bar diameters and the bending radii for all polygons.
polygonIndex: The index of the polygon.
pointIndex: The index of the first point.
numberPoints: The number of points in this polygon.

Tekla.Structures.Model.RebarGeometry.FromStruct(Tekla.Structures.ModelInternal.dotWire_t,System.Int32,System.Int32)
Internal method for transforming struct received over .NET interface into RebarGeometry class.
dotWire: The struct from which rebar data is copied.
polygonIndex: The index of the polygon.
pointIndex: The index of the first point